; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v3 - type_1 ?v8 - type_2)
 	      (pred_2 ?v2 - object ?v8 - type_2)
	      (pred_3 ?v3 - type_1 ?v7 - type_3)
	      (pred_1 ?v3 - type_1 ?v2 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v3 - type_1 ?v4 ?v1 - type_2)
       :precondition (and  (pred_4 ?v3 ?v4))
       :effect (and  (pred_4 ?v3 ?v1)
		     (not (pred_4 ?v3 ?v4))))

   (:action op_3
       :parameters (?v3 - type_1 ?v6 - object ?v5 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v5) (pred_4 ?v3 ?v5) (pred_3 ?v3 ?v7))
       :effect (and (pred_1 ?v3 ?v6 ?v7)
		    (not (pred_2 ?v6 ?v5)) 
		    (not (pred_3 ?v3 ?v7))))

   (:action op_1
       :parameters (?v3 - type_1 ?v6 - object ?v5 - type_2 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v6 ?v7) (pred_4 ?v3 ?v5))
       :effect (and (pred_2 ?v6 ?v5)
		    (pred_3 ?v3 ?v7)
		    (not (pred_1 ?v3 ?v6 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_06 obj_08 - type_1
obj_03 obj_14 obj_10 obj_12 - type_3
obj_04 obj_01 obj_11 obj_02 - type_2
obj_07 obj_13 obj_05 obj_09 - object)
(:init
(pred_4 obj_06 obj_02)
(pred_3 obj_06 obj_03)
(pred_3 obj_06 obj_14)
(pred_4 obj_08 obj_04)
(pred_3 obj_08 obj_10)
(pred_3 obj_08 obj_12)
(pred_2 obj_07 obj_11)
(pred_2 obj_13 obj_02)
(pred_2 obj_05 obj_11)
(pred_2 obj_09 obj_02)
)
(:goal
(and
(pred_2 obj_07 obj_11)
(pred_2 obj_13 obj_11)
(pred_2 obj_05 obj_04)
(pred_2 obj_09 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_06 obj_11)))
)
)

; plan
1. (op_3 obj_06 obj_13 obj_02 obj_14)
   deleted: (pred_2 obj_13 obj_02) (pred_3 obj_06 obj_14)
   added: (pred_1 obj_06 obj_13 obj_14)
   goals met: 1 of 4
2. (op_3 obj_06 obj_09 obj_02 obj_03)
   deleted: (pred_2 obj_09 obj_02) (pred_3 obj_06 obj_03)
   added: (pred_1 obj_06 obj_09 obj_03)
   goals met: 1 of 4
3. (op_2 obj_08 obj_04 obj_11)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_11)
   goals met: 1 of 4
4. (op_3 obj_08 obj_05 obj_11 obj_12)
   deleted: (pred_2 obj_05 obj_11) (pred_3 obj_08 obj_12)
   added: (pred_1 obj_08 obj_05 obj_12)
   goals met: 1 of 4
5. (op_2 obj_06 obj_02 obj_04)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_04)
   goals met: 1 of 4
6. (op_2 obj_08 obj_11 obj_04)
   deleted: (pred_4 obj_08 obj_11)
   added: (pred_4 obj_08 obj_04)
   goals met: 1 of 4
7. (op_1 obj_08 obj_05 obj_04 obj_12)
   deleted: (pred_1 obj_08 obj_05 obj_12)
   added: (pred_2 obj_05 obj_04) (pred_3 obj_08 obj_12)
   goals met: 2 of 4
8. (op_1 obj_06 obj_13 obj_04 obj_14)
   deleted: (pred_1 obj_06 obj_13 obj_14)
   added: (pred_2 obj_13 obj_04) (pred_3 obj_06 obj_14)
   goals met: 2 of 4
9. (op_3 obj_08 obj_13 obj_04 obj_12)
   deleted: (pred_2 obj_13 obj_04) (pred_3 obj_08 obj_12)
   added: (pred_1 obj_08 obj_13 obj_12)
   goals met: 2 of 4
10. (op_2 obj_08 obj_04 obj_11)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_11)
   goals met: 2 of 4
11. (op_1 obj_08 obj_13 obj_11 obj_12)
   deleted: (pred_1 obj_08 obj_13 obj_12)
   added: (pred_2 obj_13 obj_11) (pred_3 obj_08 obj_12)
   goals met: 3 of 4
12. (op_2 obj_08 obj_11 obj_04)
   deleted: (pred_4 obj_08 obj_11)
   added: (pred_4 obj_08 obj_04)
   goals met: 3 of 4
13. (op_1 obj_06 obj_09 obj_04 obj_03)
   deleted: (pred_1 obj_06 obj_09 obj_03)
   added: (pred_2 obj_09 obj_04) (pred_3 obj_06 obj_03)
   goals met: 3 of 4
14. (op_3 obj_08 obj_09 obj_04 obj_12)
   deleted: (pred_2 obj_09 obj_04) (pred_3 obj_08 obj_12)
   added: (pred_1 obj_08 obj_09 obj_12)
   goals met: 3 of 4
15. (op_2 obj_08 obj_04 obj_11)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_11)
   goals met: 3 of 4
16. (op_1 obj_08 obj_09 obj_11 obj_12)
   deleted: (pred_1 obj_08 obj_09 obj_12)
   added: (pred_2 obj_09 obj_11) (pred_3 obj_08 obj_12)
   goals met: 4 of 4
